In [2]:
import pandas as pd

In [3]:
data={'Marks':[74.23,25,10,28,80]}
df=pd.DataFrame(data)
df

   Marks
0  74.23
1  25.00
2  10.00
3  28.00
4  80.00

In [4]:
df['Marks']=df['Marks']+10
df

   Marks
0  84.23
1  35.00
2  20.00
3  38.00
4  90.00

In [5]:
def add(n):
   return n+10


def square(n):
    return n**2
print(add(20))

30

In [6]:
df['new_marks']=df['Marks'].apply(add)
df['squre']=df['Marks'].apply(square)
df

   Marks  new_marks      squre
0  84.23      94.23  7094.6929
1  35.00      45.00  1225.0000
2  20.00      30.00   400.0000
3  38.00      48.00  1444.0000
4  90.00     100.00  8100.0000

In [7]:
data={'Marks':[10,20,30,40,50]}
df=pd.DataFrame(data)
x=lambda n:n+100
df['New_Marks']=df['Marks'].apply(x)
print(df)

   Marks  New_Marks
0     10        110
1     20        120
2     30        130
3     40        140
4     50        150

In [8]:
def fun(n):
    if n%2!=0:
        return n+1
    else:
        return n
        
data={'Marks':[10,23,30,29,51]}
df=pd.DataFrame(data)
df['New']=df['Marks'].apply(fun)
df

   Marks  New
0     10   10
1     23   24
2     30   30
3     29   30
4     51   52

In [9]:
data={'Name':['aaa','bbbb','Abc','aDDD']}
df=pd.DataFrame(data)
df

   Name
0   aaa
1  bbbb
2   Abc
3  aDDD

In [10]:
def lw(text):
    return text.lower()

def up(text):
    return text.upper()

df['Lower_text']=df['Name'].apply(lw) 
df['upper_text']=df['Name'].apply(up) 
df

   Name Lower_text upper_text
0   aaa        aaa        AAA
1  bbbb       bbbb       BBBB
2   Abc        abc        ABC
3  aDDD       addd       ADDD

In [11]:
def squre(n):
    return n**2

li=[1,2,3,4,5,6,7,8]
x=map(squre,li)

for i in x:
    print(i)

1
4
9
16
25
36
49
64

In [12]:
data={'Marks':[10,23,30,29,51]}
df=pd.DataFrame(data)

df['Label'] = df['Marks'].map(lambda x: 'Pass' if x >= 30 else 'Fail')
df

   Marks Label
0     10  Fail
1     23  Fail
2     30  Pass
3     29  Fail
4     51  Pass

In [13]:
def Student_result(marks):
    if marks>=30:
        return "Pass"
    else:
        return "Fail"

df['Label_normal_fun'] = df['Marks'].map(Student_result)
df

   Marks Label Label_normal_fun
0     10  Fail             Fail
1     23  Fail             Fail
2     30  Pass             Pass
3     29  Fail             Fail
4     51  Pass             Pass

In [14]:
#  applymap():
# Works only on a DataFrame
# Applies a function to every element.
df = pd.DataFrame([[1, 2], [3, 4]])
df

   0  1
0  1  2
1  3  4

In [15]:
df = df.applymap(lambda x: x * 10)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_28336\857229037.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x: x * 10)

    0   1
0  10  20
1  30  40

In [16]:
#Reordering Of Data Frame
df=pd.DataFrame({'A':[10,20,30,40],'B':[10,20,30,40],'C':[10,20,30,40]})
df

    A   B   C
0  10  10  10
1  20  20  20
2  30  30  30
3  40  40  40

In [20]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [21]:
df.columns[::-1]

Index(['C', 'B', 'A'], dtype='object')

In [22]:
df[df.columns[::-1]]

    C   B   A
0  10  10  10
1  20  20  20
2  30  30  30
3  40  40  40